app/controllers/resevations_controller.rb

  def index
    @rooms = Room.all
    @resevations = Resevation.all
---
SELECT "resevations".* FROM "resevations"

  def create
    @resevation = Resevation.new(resevation_params)
    @resevation.user_id = current_user.id
    @resevation.save
---
INSERT INTO "resevations" ("start_day", "end_day", "number_of_people", "created_at", "updated_at", "user_id", "room_id", "price") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def show
   @resevation = Resevation.find(params[:id])
---
SELECT  "resevations".* FROM "resevations" WHERE "resevations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def posts
   @resevations = current_user.resevations.all
---
SELECT "resevations".* FROM "resevations" WHERE "resevations"."user_id" = ?  [["user_id", 3]]

  def destroy
    @resevation = Resevation.find(params[:id])
    @resevation.destroy
---
SELECT  "resevations".* FROM "resevations" WHERE "resevations"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "resevations" WHERE "resevations"."id" = ?  [["id", 4]]