app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("room_name", "introduction", "price", "address", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["room_name", ""], ["introduction", ""], ["price", ""], ["address", ""], ["created_at", "2021-06-22 06:38:43.700786"], ["updated_at", "2021-06-22 06:38:43.700786"], ["user_id", "7"]]
---
  def create
    @room = Room.new(room_params)
    @room.user_id = current_user.id
    @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."user_id" = ?  [["user_id", "3"]]
---
  def posts
    @rooms = current_user.rooms.all

SELECT  "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
DELETE FROM "rooms" WHERE "rooms"."id" = ?  [["id", 22]]
---
  def destroy
    @room = Room.find(params[:id])
    @room.destroy